"""LIFO (англ. last in, first out, "останнім прийшов - першим пішов") - спосіб організації даних або 
іншими словами Стек (Stack). 
У структурованому лінійному списку, організованому за принципом LIFO, 
елементи можуть додаватися та вибиратися тільки з одного кінця, що називається «вершиною списку». 
Структура LIFO може бути проілюстрована наступним малюнком.

lifo
За допомогою колекції deque реалізуйте структуру даних LIFO. 
Створіть змінну lifo, що містить колекцію deque. Обмежте розмір за допомогою константи MAX_LEN. 
Функція push додає значення element на початок списку lifo. 
Функція pop дістає та повертає перше значення зі списку lifo."""

from collections import deque

MAX_LEN = 5  # Задайте бажаний розмір lifo

lifo = deque(maxlen=MAX_LEN)

def push(element):
    lifo.appendleft(element)

def pop():
    if lifo:
        return lifo.popleft()
    else:
        return None  # або будь-яке значення, що ви обираєте для позначення порожнього стеку
    
#В цьому прикладі deque створюється з обмеженням розміру MAX_LEN, 
# і функції push та pop використовують відповідні методи appendleft та popleft для забезпечення LIFO-поведінки.

#Примітка: None як значення за замовчуванням для порожнього стеку у функції pop, 
# але можна замінити його на інше значення за вибором або викинути виключення, 
# якщо хочеш, щоб функція повертала помилку при спробі витягти з порожнього стеку.