"""Рекурсія добре підходить до задачі flatentening. Це процес вирівнювання списків,
який полягає в позбавленні вкладеної структури.
Наприклад список вигляду [1, 2, [3, 4, [5, 6]], 7]
має бути перетворений на плоский (flat) список [1, 2, 3, 4, 5, 6, 7]

Напишіть функцію flatten, яка приймає на вхід список,
рекурсивно вирівнюватиме цей список і повертатиме пласку версію списку.

Для виконання завдання можна дотримуватися наступного алгоритму:

Якщо вхідний список порожній, то:
  Повертаємо порожній список
Якщо перший елемент списку є списком, то:
  Отримуємо перший список, рекурсивно викликавши функцію з першим елементом списку
  Отримуємо другий список, рекурсивно викликавши функцію з рештою списку без першого елемента
  Повертаємо конкатенацію двох списків
Якщо перший елемент списку не є списком, то:
  Отримуємо перший список із першого елемента списку
  Отримуємо другий список, рекурсивно викликавши функцію з рештою списку без першого елемента
  Повертаємо конкатенацію двох списків
  """

def flatten(data):
    if not data:
        return []
    elif isinstance(data[0], list):
        return flatten(data[0]) + flatten(data[1:])
    else:
        return [data[0]] + flatten(data[1:])

# Приклад використання:
nested_list = [1, 2, [3, 4, [5, 6]], 7]
flat_list = flatten(nested_list)
print(flat_list)
        